riot-ci/RIOT/cpu/atmega128rfa1/include/periph_cpu.h
/*
 * Copyright (C) Josua Arndt, Steffen Robertz 2017 RWTH Aachen
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup         cpu_atmega128rfa1
 * @{
 *
 * @file
 * @brief           CPU specific definitions for internal peripheral handling
 *
 * @author          Josua Arndt <jarndt@ias.rwth-aachen.de>
 * @author          Steffen Robertz <steffen.robertz@rwth-aachen.de>
 */

#ifndef PERIPH_CPU_H
#define PERIPH_CPU_H

#include "periph_cpu_common.h"
#include "atmega_regs_common.h"

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @name   Available ports on the ATmega128rfa1 MCU
 * @{
 */
enum {
    PORT_B = 1,         /**< port B */
    PORT_D = 3,         /**< port D */
    PORT_E = 4,         /**< port E */
    PORT_F = 5,         /**< port F */
    PORT_G = 6,         /**< port G */
    PORT_EXT = 7        /**< first expander port */
};

/**
 * @brief   Available ports on the ATmega128rfa1 MCU as GPIO register definitions
 */
#define GPIO_CPU_PORTS \
    { .reg = (gpio_reg_t)0     }, /* n/a    */ \
    { .reg = (gpio_reg_t)0x25  }, /* port B */ \
    { .reg = (gpio_reg_t)0     }, /* n/a    */ \
    { .reg = (gpio_reg_t)0x2b  }, /* port D */ \
    { .reg = (gpio_reg_t)0x2e  }, /* port E */ \
    { .reg = (gpio_reg_t)0x31  }, /* port F */ \
    { .reg = (gpio_reg_t)0x34  }, /* port G */

/**
 * @brief   Available external interrupt pins on the ATmega128rfa1 MCU
 *
 * In order of their interrupt number.
 */
#define CPU_ATMEGA_EXT_INTS    { GPIO_PIN(PORT_D, 0), \
                                 GPIO_PIN(PORT_D, 1), \
                                 GPIO_PIN(PORT_D, 2), \
                                 GPIO_PIN(PORT_D, 3), \
                                 GPIO_PIN(PORT_E, 4), \
                                 GPIO_PIN(PORT_E, 5), \
                                 GPIO_PIN(PORT_E, 6), \
                                 GPIO_PIN(PORT_E, 7) }

/**
 * @name   Defines for the I2C interface
 * @{
 */
#define I2C_PORT_REG            PORTD
#define I2C_PIN_MASK            (1 << PORTD1) | (1 << PORTD0)
/** @} */

/**
 * @name    EEPROM configuration
 * @{
 */
#define EEPROM_SIZE             (4096U)  /* 4kB */
/** @} */

#ifdef __cplusplus
}
#endif

#endif /* PERIPH_CPU_H */
/** @} */
